Revit 2026 API

# IFCLinkDocumentExportScope Class

---

A class that allows for the export of one linked document to IFC.

SystemObject Autodesk.Revit.DB.IFCIFCLinkDocumentExportScope

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCLinkDocumentExportScope : IDisposable
```
```vb
Public Class IFCLinkDocumentExportScope
	Implements IDisposable
```
```cpp
public ref class IFCLinkDocumentExportScope : IDisposable
```
```fsharp
type IFCLinkDocumentExportScope =
    class
        interface IDisposable
    end
```

The IFCLinkDocumentExportScope type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IFCLinkDocumentExportScope | Instantiates a default IFCLinkDocumentExportScope object. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the IFCLinkDocumentExportScope |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Linked documents can only be exported within a transaction, but it is illegal to start a transaction for a linked document. This gives a special exception that does the work necessary to make sure that the host documents do not end up in unstable states after the export. This is not guaranteed for any other workflow. To ensure that the lifetime of the object is correctly managed, you should declare an instance of this class as a part of a 'using' statement in C# or similar construct in other lanuguages.

#### Reference

Autodesk.Revit.DB.IFC Namespace